{
  "architectures": ["LlamaForCausalLM"],
  "model_type": "llama",
  "vocab_size": 32000,
  "hidden_size": 128,
  "intermediate_size": 256,
  "num_hidden_layers": 2,
  "num_attention_heads": 2,
  "num_key_value_heads": 2,
  "hidden_act": "silu",
  "max_position_embeddings": 2048,
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-05,
  "use_cache": true,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "rope_theta": 10000.0,
  "torch_dtype": "bfloat16"
}
